print("--- Лабораторна робота 1 ---")

a = float(input("Введіть перше число: "))
b = float(input("Введіть друге число: "))

print("\n--- Загальне завдання ---")
print(f"Сума: {a + b}")
print(f"Різниця: {a - b}")
print(f"Добуток: {a * b}")

if b != 0:
    print(f"Частка: {a / b}")
else:
    print("Помилка: Ділення на нуль неможливе!")

print("\n--- Індивідуальне завдання (Варіант 9) ---")

num1 = int(a)
num2 = int(b)

if num2 == 0:
    print("Помилка: Нуль не може бути дільником!")
elif num1 % num2 == 0:
    
    print(f"Результат: Так, число {num2} є дільником числа {num1}.")
else:
    print(f"Результат: Ні, число {num2} не є дільником числа {num1}.")