print("--- Лабораторна робота 1 ---")
# Зчитуємо дані з клавіатури та одразу перетворюємо їх у дійсні числа (float)
a = float(input("Введіть перше число: "))
b = float(input("Введіть друге число: "))


print("\n--- Загальне завдання ---")
# Виконуємо базові математичні операції та виводимо результати за допомогою f-рядків
print(f"Сума: {a + b}")
print(f"Різниця: {a - b}")
print(f"Добуток: {a * b}")


# Перевіряємо, чи не дорівнює знаменник нулю, щоб уникнути критичної помилки (ZeroDivisionError)
if b != 0:
    print(f"Частка: {a / b}")
else:
    print("Помилка: Ділення на нуль неможливе!")


print("\n--- Індивідуальне завдання (Варіант 9) ---")


# Конвертуємо змінні у цілочисельний тип (int), оскільки перевірка на дільник робиться для цілих чисел
num1 = int(a)
num2 = int(b)


# Перевіряємо, чи потенційний дільник не є нулем
if num2 == 0:
    print("Помилка: Нуль не може бути дільником!")
# Використовуємо оператор % для знаходження залишку від ділення. Якщо залишок 0 — число є дільником
elif num1 % num2 == 0:  
    print(f"Результат: Так, число {num2} є дільником числа {num1}.")
# Якщо залишок більше нуля, число не є дільником
else:
    print(f"Результат: Ні, число {num2} не є дільником числа {num1}.")