# Implement task here
# Лабораторна робота №1 з теми "Основи роботи з Python: змінні, типи даних та операції"
# Варіант 1
# Введення першого числа з клавіатури
a = float(input("Введіть перше число:"))

# Введення другого числа з клавіатури
b = float(input("Введіть друге число:"))

# Додавання чисел
sum_result = a + b

#Виведення результату додавання
print("Сума чисел:", sum_result)

# Віднімання чисел
diff_result = a - b

#Виведення результату віднімання
print("Різниця чисел:", diff_result)

# Множення чисел
multiply_result = a * b

#Виведення результату множення
print("Добуток чисел:", multiply_result)

# Ділення чисел та виведення результату ділення
if b != 0:
    divide_result = a / b
    print("Частка чисел:", divide_result)
else:
    print("Ділення на нуль неможливе!")

# Цілочисельне ділення та виведення результату
if b != 0:
    floordiv_result = a // b
    print("Частка без остачі:", floordiv_result)
else:
    print("Ділення на нуль неможливе!")

# Знаходження остачі від ділення та виведення результату
if b != 0:
    modulus_result = a % b
    print("Остача від ділення:", modulus_result)
else:
    print("Ділення на нуль неможливе!")

# Піднесення числа a до степеня b
exponent_result_1 = a ** b

#Виведення результату піднесення числа a до степеня b
print("Результат піднесення числа a до степеня b:", exponent_result_1)

# Піднесення числа b до степеня a
exponent_result_2 = b ** a

#Виведення результату піднесення числа b до степеня a
print("Результат піднесення числа b до степеня a:", exponent_result_2)