print("Виконання основного завдання")
#введення двох чисел типу float
a = float(input("Введіть перше число: "))
b = float(input("Введіть друге число: "))

#вивід результатів арифметичних операцій
print(f"Сума: {a + b}")
print(f"Різниця: {a - b}")
print(f"Добуток: {a * b}")

#перевірка ділення на нуль
if b != 0:
    print(f"Частка: {a / b }")
else:
    print("Ділення на нуль неможливе!")

#виконання індивідуального завдання (Варіант 2)
print("\nВиконання індивідуального завдання (Варіант 2)")
a = float(input("Введіть зменшуване: "))
b = float(input("Введіть від’ємник: "))
result = a - b

#вивід результату віднімання
print(f"Результат віднімання: {a} - {b} = {result}")