# Лабораторна робота No1
# Тема: Основи роботи з Python: змінні, типи даних та операції

a = float(input("Введіть перше число:"))
b = float(input("Введіть друге число:"))

print(f"Додавання: {a} + {b} = {a + b}")
print(f"Віднімання: {a} - {b} = {a - b}")
print(f"Множення: {a} * {b} = {a * b}")

# Перевірка ділення на нуль
if b != 0:
    print(f"Ділення: {a} / {b} = {a / b}")
else:
    print("Ділення: На нуль ділити не можна!")

# Індивідуальне завдання мого варіанту
# Програма для визначення більшого з двох чисел.

if a > b:
    print(f"Більше число: a ({a})")
elif b > a:
    print(f"Більше число: b ({b})")
else:
    print("Числа рівні")