# Лабораторна робота No2
# Тема:  Використання операторів умовного виконання та циклів у мові програмування Python.
# Варіант 2 

# 1. Введення даних
n = int(input("Введіть число: "))

if n < 0:
    print("Факторіал від'ємних чисел не існує")
else:
    # Початкові значення
    factorial = 1
    i = 1
    
    # 2. Обчислення за допомогою циклу while
    while i <= n:
        factorial = factorial * i
        i = i + 1  # збільшуємо лічильник
        
    # 3. Виведення результату
    print("Результат:", factorial)