print("Програма обчислення факторіалу")

# Введення початкових даних
try:
    n = int(input("Введіть ціле невід'ємне число (n): "))

    #Обробка даних 
    if n < 0:
        print("Помилка: Факторіал визначений лише для невід'ємних чисел.")
    elif n == 0:
        print("Факторіал 0! дорівнює 1")
    else:
        fact = 1
        # Використання циклу for для обчислення
        for i in range(1, n + 1):
            fact = fact * i
        
        # Виведення результатів 
        print(f"Факторіал числа {n}! дорівнює {fact}")

except:
    print("Помилка: Будь ласка, введіть коректне ціле число.")
