#беремо числа від користувача
s = int(input("Start from: "))#перетворюємо зразу на ціле
f = int(input('Finish to: '))

#для відповіді
ans = []

#шукаємо числа в інтервалі
for i in range(s,f+1):#проходимо по кожному числу в інтервалі від s до f+1, бо функція range не включає останнє число, тому ми додаємо 1 до f, щоб включити його в інтервал
    #перевіряємо чи є число простим
    if i > 1:#число має бути більше за 1
        for j in range(2, i):#перевіряємо чи ділиться число на будь-яке число від 2 до нього самого
            if (i % j) == 0:#якщо число ділиться на будь-яке число від 2 до нього самого, то воно не є простим
                break#завершуємо цикл, якщо число не є простим
        else:#якщо число не ділиться на будь-яке число від 2 до нього самого, то воно є простим
            ans.append(i)#додаємо просте число до відповіді

#виводимо відповідь
print(ans)
