# Дані для завдання

# Словник для перевірки (варіант 6)
data = {"name": "Олена", "age": 20, "faculty": "КН"}

# Файл для запису помилок (варіант 8)
error_file = "error.log"

# Файл для зчитування (варіанти 5, 9)
input_file = "input.txt"

# Формат даних у файлі (варіант 9): "ім'я:вік" у кожному рядку

# Реалізуйте завдання тут
import logging


# Налаштування логування: запис у файл 'error_log.txt'
logging.basicConfig(
    filename='error_log.txt',
    level=logging.ERROR,
    format='%(asctime)s - %(levelname)s - %(message)s',
    encoding='utf-8' # Забезпечує коректний запис кирилиці
)


print("--- Програма перевірки цілого числа ---")


try:
    # Зчитування даних від користувача
    user_input = input("Будь ласка, введіть ціле число: ")
   
    # Спроба перетворити введене значення на ціле число (тип int)
    number = int(user_input)


except ValueError:
    # Обробка помилки некоректного введення даних
    error_message = f"Введене значення '{user_input}' не є цілим числом."
   
    # Виведення повідомлення про помилку на екран
    print(f"Помилка: {error_message}")
   
    # Запис інформації про виняток у логфайл
    logging.error(error_message)


else:
    # Цей блок виконується лише у випадку, якщо помилок (винятків) не виникло
    print(f"Чудово! Ви ввели коректне ціле число: {number}")


finally:
    # Цей блок виконується завжди, незалежно від того, чи була помилка
    print("Роботу програми завершено.")