# Реалізуйте функцію для вашого варіанту та викличте її для тестових значень
# Виведіть результат кожного виклику за допомогою print()
#
# Тестові значення:
# 1) Периметр прямокутника: (5, 3), (10, 7), (2.5, 4)
# 2) Факторіал: 5, 8
# 3) Цельсій → Фаренгейт: 0, 100, 37
# 4) Кілометри → метри: 1, 5.5, 0.25
# 5) Години → хвилини: 2, 5.5, 0.25
# 6) Середнє арифметичне: [15, 25, 35], [100, 200, 300]
# 7) Площа квадрата: 5, 12, 7
# 8) Найбільше з трьох: (3, 17, 5), (10, 2, 8), (42, 15, 38)
# 9) Дюйми → сантиметри: 1, 10, 5
# 10) Кількість голосних: "hello world", "education", "beautiful day"


# 8) Реалізувати функцію для знаходження найбільшого з трьох чисел.
numbers1 = (3, 17, 5)
numbers2 = (10, 2, 8)
numbers3 = (42, 15, 38)

def max_numer(numbers) :
    if numbers[0] > numbers[1] and numbers[0] > numbers[2] :
        return numbers[0]
    elif numbers[1] > numbers[2]:
        return numbers[1]
    else:
        return numbers[2]

print(f"Найбільше число серед трьох:", max_numer(numbers1))
print(f"Найбільше число серед трьох:", max_numer(numbers2))
print(f"Найбільше число серед трьох:", max_numer(numbers3))