# Реалізуйте функцію для вашого варіанту та викличте її для тестових значень
# Виведіть результат кожного виклику за допомогою print()
#
# Тестові значення:
# 1) Периметр прямокутника: (5, 3), (10, 7), (2.5, 4)
# 2) Факторіал: 5, 8
# 3) Цельсій → Фаренгейт: 0, 100, 37
# 4) Кілометри → метри: 1, 5.5, 0.25
# 5) Години → хвилини: 2, 5.5, 0.25
# 6) Середнє арифметичне: [15, 25, 35], [100, 200, 300]
# 7) Площа квадрата: 5, 12, 7
# 8) Найбільше з трьох: (3, 17, 5), (10, 2, 8), (42, 15, 38)
# 9) Дюйми → сантиметри: 1, 10, 5
# 10) Кількість голосних: "hello world", "education", "beautiful day"


# 6 варіант
def calculate_average(numbers_list: list):
    elements_sum = sum(numbers_list)
    elements_amount = len(numbers_list)
    average = elements_sum / elements_amount
    return average

print(calculate_average([15, 25, 35]))
print(calculate_average([100, 200, 300]))
