# Лабораторна робота 9: Регулярні вирази

# Реалізуйте завдання тут
# 
# Варіант 6
# Видалення всіх небажаних символів з тексту

import re

# Вхідний текст
text = "Привіт!!! Це тестовий текст №1, з небажаними символами: @, #, $, %, &*."

# Регулярний вираз для видалення всіх символів,
# крім літер, цифр, пробілів і розділових знаків крапка та кома
clean_text = re.sub(r"[^а-яА-Яa-zA-Z0-9\s.,]", "", text)

# Виведення результатів
print("Початковий текст:")
print(text)

print("\nТекст після видалення небажаних символів:")
print(clean_text)