# Дані для завдання

# Список цілих чисел
numbers = [12, 7, 45, 3, 28, 15, 9, 33, 21]

# Другий список цілих чисел
numbers2 = [50, 60, 70]

# Список з повторюваними елементами
numbers_with_duplicates = [4, 2, 7, 2, 9, 4, 1, 7, 3]

# Словник з іменами та віком
people = {"Олена": 25, "Іван": 30, "Марія": 22, "Петро": 35, "Анна": 28, "Сергій": 40}

# Значення для видалення зі списку
value_to_remove = 45

# Значення для пошуку в словнику
value_to_find = 30

# Реалізуйте завдання тут
# Індивідуальне завдання: Реалізувати програму для перевірки, чи є два списки однаковими.

#Функція порівнює два списки
def equality_check(numbers_list, numbers_list2):
    return numbers_list == numbers_list2

#Функція приймає булеве значення (True/False) та виводить відповідне текстове повідомлення
def check(result):
    if result:
        print("Списики однакові")
    else:
        print("Списки не однакові")

# Викликаємо функцію порівняння та зберігаємо результат (True або False) у змінну
secret_box = equality_check(numbers, numbers2)

# Передаємо отриманий результат у функцію для друку повідомлення користувачу
check(secret_box)
